[
  {
    "id": 1,
    "title": "Dakar Desert Rally",
    "description": "Niektoré hry musia najskôr dozrieť, kým si ich hráči budú môcť vychutnať v plnej paráde. Zdá sa, že Dakar Desert Rally bude tiež takým prípadom.",
    "paragraph1": "O hru sa stará portugalská vetva štúdia Saber Interactive a sú to všetko nadšenci, ktorí Dakar naozaj zbožňujú, čo je na hre aj vidno. Zároveň oproti iným licencovaným športovým hrám zahodili číslovku či označenie ročníka a dôvod na to je jednoduchý. Toto totiž nie je len Dakar hra k aktuálnemu ročníku, ale má predstavovať všetko, čím je aktuálne Dakar. Najznámejšia svetová rally síce nesie názov po senegalskom meste, ale od roku 2020 sa jazdí v Saudskej Arábii a hra pokrýva práve toto obdobie, teda nielen ročník 2022, ale aj roky 2021 a 2020.",
    "paragraph2": "Je tu tak toho dosť, ale to len zdanlivo. Už prvé spustenie vám ukáže, že aj keď hre nechýba srdce, sú tu veci, ktoré chýbajú. Prezentácia je totiž dosť odfláknutá a hra s licenciou Dakaru by si zaslúžila niečo veľkolepejšie. Tu je to veľmi strohé a pretavilo sa to aj do hernej ponuky, ktorá je skromná. Ak sa nechcete detailnejšie vŕtať v nastaveniach, máte na výber už len rebríčky, multiplayer a kampaň. Nenájdete tu rýchlu hru, nenájdete tu ani lokálny multiplayer a ani podobné veci. A už asi chápete, prečo je podľa mňa písať o tom, čo všetko v hre nie je. Ani tu ale, bohužiaľ, nekončí výpis vecí, ktoré v Dakar Desert Rally chýbajú. Autori to už ale teraz pri vydaní kompenzujú nízkou cenou.",
    "paragraph3": "Graficky je nový Dakar fajn. Ja viem, že to nie je najkrajšia hrana svete, ale v zásade vyzerá dobre a ak si pri obrázkoch a videách všimnete nedostatky, priamo v hre pri jazdení ich už tak nevnímate. Hlavne pri menej typickom počasí a dobre zvolenej dennej dobe vie hra graficky aj prekvapiť a vyzerá naozaj dobre. teda nočné jazdenie v búrke či prekonávanie dún počas západu slnka. Zvuk je veľmi dobrý. Vozidlá znejú realisticky a do jazdenia vám hrá síce generická, ale dobre znejúca rocková hudba. Navigátor je spracovaný perfektne, jeho hlas neruší a inštrukcie sú tak presné, že som už po pár dňoch začal jazdiť len podľa nich a roadbook som ani nesledoval. Čo bol problém na motorkách, lebo tam navigátora nemáte.",
    "paragraph4": "Raz to bude perfektná hra, ale zatiaľ je Dakar Desert Rally len akýsi Early Access, ktorý má veľa potenciálu a málo obsahu. Chýbajú trasy, chýbajú multiplayerové možnosti, chýbajú režimy alebo aj úplne bežné veci, ktoré od hry čakáte. Dokonca aj force feedback (ktorý som si vyskúšal na Gamescome a je spracovaný dobre) je zapracovaný len čiastočne v tom ohľade, že je podpora volantov veľmi úzka. Napríklad Fanatec dostane podporu FF neskôr. Niekedy v budúcnosti si túto hru kúpte a užite, také je moje odporúčanie. Užiť si ju síce môžete aj teraz, ale bude to dosť krátke a neviem, ako dlho budeme čakať na to, kým príde ten zvyšok.",
    "imageSrc": "public/images/dakar-desert-rally-38316-7607494-2-1070.jpg",
    "imageAlt": "dakar"
  },
  {
    "id": 2,
    "title": "FIFA 23",
    "description": "Toto je posledná hra s názvom FIFA od EA Sports, mohla by byť preto výnimočná. Alebo ponúka v porovnaní s predchádzajúcimi ročníkmi len kozmetické zmeny?",
    "paragraph1": "Každý, kto sleduje situáciu v hernej oblasti, asi začul ruch okolo licencie FIFA a EA Sports. Výsledný stav je taký, že FIFA 23 je posledná hra, ktorá nadväzuje na dlhoročnú tradíciu. Preto je to sčasti unikátny kúsok pre fanúšikov, hoci možno sa budúci rok dočkajú viac-menej podobnej hry s iným názvom. FIFA 23 má tak šancu ukázať sa v najlepšom svetle a už aj nové konzoly pokročili do fázy, že sa s nimi vie EA Sports vyhrať.",
    "paragraph2": "Širší priestor dostal ženský futbal. Jedna vec je hrať za ženy v priateľských zápasoch, iná je pustiť sa s nimi aj do futbalových líg. Medzinárodné tímy sú roky prístupné, teraz sa otvárajú dve ligy: anglická a francúzska, tak si môžete zahrať za ženskú Chelsea či PSG. Nové technológie sa snažia lepšie previesť na obrazovky aj ženské pohyby a jediná nevýhoda je, že možnosti ženského futbalu sa síce rozšírili, ale stále sú limitované na priateľské zápasy, turnaje, sezónu, ale už si dámsky tím nezoberiete ďalej.",
    "paragraph3": "Pre všetky zápasy na veľké ihriská sa aplikuje nová technológia. HyperMotion si zažil vlani premiéru a tento rok prichádza verzia HyperMotion 2, ktorá pokračuje v nastolenom trende realistického podania a snaží sa priniesť najlepšie podané zápasy, minúty pred nimi, počas i po nich. V praxi to znamená, že sa hráči či hráčky snažia reálnejšie behať po trávniku, útočiť či brániť, resp. aj púšťať do súbojov a dotykov. Je tu zachytených veľa pohybov v 90 minútach, gestá v tvári a kopa nových drobných animácií. Autori sa hrdia, že snímali všetkých 22 hráčov počas celého zápasu. Pre vás to znamená, že lopta nie je prilepená na kopačke, ale pohybuje sa ako samostatný objekt, hráči ju vedia spracovať realisticky a aj drobné animácie sú zobrazené so zmyslom pre detail. Platí to pre mužské i ženské zápasy a najmä aj pri finesách ako sú aj prihrávky a strely.",
    "paragraph4": "Po prvom týždni sú pocity z hry zatiaľ pomerne dobré. Vlaňajší ročník bol azda väčšou revolúciou, ale drobné vylepšenia cítiť. Napríklad zdanlivo drobná fíčurka „AcceleRATE“ sa ukáže byť slušným pomocníkom: keď niektorý hráč dokáže vyštartovať v dobrom čase s loptou do šprintu, nie každý obranca ho zachytí. Tempo hry je pomalšie, no gólov padá pomerne dosť (aj súper sa snaží). Rozdiely medzi jednotlivými stupňami obťažnosti sú veľké – ak sa vám podarí na nižšej excelovať, tá o level vyššia vás vyzve na pár ťažkých zápasov, kým si zvyknete.",
    "imageSrc": "public/images/fifa-23-38317-5993158-1-1070.jpg",
    "imageAlt": "fifa23"
  },
  {
    "id": 3,
    "title": "Call of Duty MW2",
    "description": "Infinity Ward preberá štafetu a v tohtoročnom Call of Duty Modern Warfare II ukáže, ako má správne Call of Duty vyzerať.",
    "paragraph1": "Podľa Call of Duty sme si mohli doteraz nastaviť kalendáre, prichádzalo pravidelne každý rok a každý rok sa posúvalo niekam inam. Do iných bojov, iných dôb. Až doteraz. Aktuálne vydávané Call of Duty Modern Warfare 2 bude práve to, ktoré ukončí neprerušenú líniu hier od roku 2005.  Budúci rok totiž veľká COD hra nepríde a fanúšikovia série si budú musieť vystačiť s rozšírením Modern Warfare 2.",
    "paragraph2": "Modern Warfare 2 hráčov znovu zavedie do novodobej vojny s modernými zbraňami a, samozrejme, aj kampaňou, ktorá bude pokračovať v príbehu Task Force 141 s Johnom Priceom, Ghostom a Soapom. Nebude chýbať kooperačný doplnok. K tomu celému prídu aj novinky, a to samostatné Call of Duty Warzone 2 a pridá sa aj DMZ režim v štýle Tarkova.",
    "paragraph3": "Čo sa však týka kvality samotných misii je to, ako na hojdačke, sú tu parádne a doslova aj mizerne spracované misie, ktoré sú akoby od nejakých amatérov.  Zatiaľ, čo klasické strelecké misie sú väčšinou bezproblémové, niektoré majú jedinečné prostredia a dobrú akciu, aj keď iné sú menej zaujímavé, ale pocit zo streľby to vynahradzuje. Špeciálne snajperská misia je tu znovu veľmi dobrá.  Problémom je používanie nových prvkov, ktoré nie vždy sadli. Respektíve ich skĺbenie so skriptovanými misiami a jednou cestou vpred.",
    "paragraph4": "Celkovo je Call of Duty Modern Warfare II slušným nasledovníkom jednotky a hlavne po slabších Black Ops a Vanguard hrách návrat späť. Špeciálne v multiplayeri, ktorý má dobrú a teraz ešte vylepšenú hrateľnosť, ešte zmenšené mapy pre intenzívne boje, ale zároveň aj veľké mapy pre masívne Ground War boje, všetko s novými prvkami do možností pohybu. Kampaň nesadne každému, ale vidieť, že autori skúšali rôzne prvky a hlavne drsnejší štýl. Celé to dopĺňa kooperácia, ktorá má síce dobrý základ, ale zatiaľ len tri mapy. Uvidíme, ako sa to bude celé rozvíjať, ale základ tu je dobrý. Už len čakať, ako budú autori schopní dodávať obsah. Zatiaľ vieme, že teraz v novembri príde ako Warzone 2, tak aj DMZ režim v štýle Escape from Tarkov.",
    "imageSrc": "public/images/new_era-mw2.jpg",
    "imageAlt": "COD MW2"
  },
  {
    "id": 7,
    "title": "WWWWWWWWWWW",
    "description": "eeeeeeeeeeeeeeee",
    "paragraph1": "weeee",
    "paragraph2": "",
    "paragraph3": "",
    "paragraph4": "",
    "imageSrc": "https://media.tenor.com/vRoGmwXYMvAAAAAM/piggy.gif",
    "imageAlt": ""
  },
  {
    "id": 8,
    "title": "sdfsdfs",
    "description": "sdfsdfsdfasdasdsa",
    "paragraph1": "sdfsdfsd",
    "paragraph2": "",
    "paragraph3": "",
    "paragraph4": "",
    "imageSrc": "https://d2r55xnwy6nx47.cloudfront.net/uploads/2018/07/SolarFull_SeanDoran_2880FullwidthLede.jpg",
    "imageAlt": ""
  }
]